[
    {
        "id": 1,
        "title": "Nineteen Eighty-Four",
        "author": "George Orwell",
        "year": 1949,
        "genres": [
            "dystopian",
            "political fiction",
            ""
        ],
        "pages": 328,
        "description": "1984 is a dystopian novella by George Orwell published in 1949, which follows the life of Winston Smith, a low ranking member of 'the Party', who is frustrated by the omnipresent eyes of the party, and its ominous ruler Big Brother. 'Big Brother' controls every aspect of people's lives."
    },
    {
        "id": 0,
        "title": "Alice's Adventures in Wonderland",
        "author": "Charles Lutwidge Dodgson",
        "year": 1865,
        "genres": [
            "novel",
            "fantasy",
            ""
        ],
        "pages": 235,
        "description": "Alice's Adventures in Wonderland (commonly shortened to Alice in Wonderland) is an 1865 novel by English author Lewis Carroll (the pseudonym of Charles Dodgson). It tells of a young girl named Alice, who falls through a rabbit hole into a subterranean fantasy world populated by peculiar, anthropomorphic creatures."
    },
    {
        "id": 2,
        "title": "Harry Potter and the Philosopher's Stone",
        "author": "J. K. Rowling",
        "year": 1997,
        "genres": [
            "novel",
            "fantasy",
            ""
        ],
        "pages": 223,
        "description": "Harry Potter and the Philosopher's Stone is a fantasy novel written by British author J. K. Rowling. The first novel in the Harry Potter series and Rowling's debut novel, it follows Harry Potter, a young wizard who discovers his magical heritage on his eleventh birthday, when he receives a letter of acceptance to Hogwarts School of Witchcraft and Wizardry. Harry makes close friends and a few enemies during his first year at the school, and with the help of his friends, Harry faces an attempted comeback by the dark wizard Lord Voldemort, who killed Harry's parents, but failed to kill Harry when he was just 15 months old."
    }
]